LuckiBit/stm32-template/stm32f429ig/application/app/tasks/tasks.c
/**
 * @file tasks.c
 * @brief Owns numbered RTOS template resources, including unused expansion slots.
 */

#include "tasks.h"
#include "FreeRTOS.h"
#include "event_groups.h"
#include "led.h"
#include "queue.h"
#include "semphr.h"
#include "system_manager.h"
#include "task.h"
#include "timers.h"

#include <stdbool.h>
#include <stdint.h>

/** Numbered names are intentional template slots requested for product expansion.
 * Stack depths use StackType_t units. Task count does not determine priority count.
 */
#define TASK_NAME_0        "task_0"
#define TASK_STACK_DEPTH_0 configMINIMAL_STACK_SIZE
#define TASK_PRIORITY_0    (tskIDLE_PRIORITY + 1U)

#define TASK_NAME_1        "task_1"
#define TASK_STACK_DEPTH_1 configMINIMAL_STACK_SIZE
#define TASK_PRIORITY_1    (tskIDLE_PRIORITY + 2U)

#define TASK_NAME_2        "task_2"
#define TASK_STACK_DEPTH_2 configMINIMAL_STACK_SIZE
#define TASK_PRIORITY_2    (tskIDLE_PRIORITY + 3U)

#define TASK_NAME_3        "task_3"
#define TASK_STACK_DEPTH_3 configMINIMAL_STACK_SIZE
#define TASK_PRIORITY_3    (tskIDLE_PRIORITY + 4U)

#define TASK_NAME_4        "task_4"
#define TASK_STACK_DEPTH_4 configMINIMAL_STACK_SIZE
#define TASK_PRIORITY_4    (tskIDLE_PRIORITY + 5U)

#define TASK_NAME_5        "task_5"
#define TASK_STACK_DEPTH_5 configMINIMAL_STACK_SIZE
#define TASK_PRIORITY_5    (tskIDLE_PRIORITY + 1U)

#define TASK_NAME_6        "task_6"
#define TASK_STACK_DEPTH_6 configMINIMAL_STACK_SIZE
#define TASK_PRIORITY_6    (tskIDLE_PRIORITY + 1U)

#define TASK_NAME_7        "task_7"
#define TASK_STACK_DEPTH_7 configMINIMAL_STACK_SIZE
#define TASK_PRIORITY_7    (tskIDLE_PRIORITY + 1U)

#define TASK_NAME_8        "task_8"
#define TASK_STACK_DEPTH_8 configMINIMAL_STACK_SIZE
#define TASK_PRIORITY_8    (tskIDLE_PRIORITY + 1U)

#define TASK_NAME_9        "task_9"
#define TASK_STACK_DEPTH_9 configMINIMAL_STACK_SIZE
#define TASK_PRIORITY_9    (tskIDLE_PRIORITY + 1U)

#define TASK_NAME_10        "task_10"
#define TASK_STACK_DEPTH_10 configMINIMAL_STACK_SIZE
#define TASK_PRIORITY_10    (tskIDLE_PRIORITY + 1U)

#define TASK_NAME_11        "task_11"
#define TASK_STACK_DEPTH_11 configMINIMAL_STACK_SIZE
#define TASK_PRIORITY_11    (tskIDLE_PRIORITY + 1U)

#define TASK_NAME_12        "task_12"
#define TASK_STACK_DEPTH_12 configMINIMAL_STACK_SIZE
#define TASK_PRIORITY_12    (tskIDLE_PRIORITY + 1U)

#define TASK_NAME_13        "task_13"
#define TASK_STACK_DEPTH_13 configMINIMAL_STACK_SIZE
#define TASK_PRIORITY_13    (tskIDLE_PRIORITY + 1U)

#define TASK_NAME_14        "task_14"
#define TASK_STACK_DEPTH_14 configMINIMAL_STACK_SIZE
#define TASK_PRIORITY_14    (tskIDLE_PRIORITY + 1U)

#define TASK_NAME_15        "task_15"
#define TASK_STACK_DEPTH_15 configMINIMAL_STACK_SIZE
#define TASK_PRIORITY_15    (tskIDLE_PRIORITY + 1U)

#define QUEUE_LENGTH_0    5U
#define QUEUE_ITEM_TYPE_0 uint32_t
#define QUEUE_LENGTH_1    5U
#define QUEUE_ITEM_TYPE_1 uint32_t
#define QUEUE_LENGTH_2    5U
#define QUEUE_ITEM_TYPE_2 uint32_t
#define QUEUE_LENGTH_3    5U
#define QUEUE_ITEM_TYPE_3 uint32_t
#define QUEUE_LENGTH_4    5U
#define QUEUE_ITEM_TYPE_4 uint32_t
#define QUEUE_LENGTH_5    5U
#define QUEUE_ITEM_TYPE_5 uint32_t
#define QUEUE_LENGTH_6    5U
#define QUEUE_ITEM_TYPE_6 uint32_t
#define QUEUE_LENGTH_7    5U
#define QUEUE_ITEM_TYPE_7 uint32_t

#define TIMER_NAME_0      "timer_0"
#define TIMER_PERIOD_MS_0 500U
#define TIMER_NAME_1      "timer_1"
#define TIMER_PERIOD_MS_1 1000U
#define TIMER_NAME_2      "timer_2"
#define TIMER_PERIOD_MS_2 1000U
#define TIMER_NAME_3      "timer_3"
#define TIMER_PERIOD_MS_3 1000U

#define EVENT_TIMER_BIT_0 ((EventBits_t)(1U << 0))
#define EVENT_TIMER_BIT_1 ((EventBits_t)(1U << 0))

#if QUEUE_0_ENABLE
static uint8_t s_queue_storage_0[QUEUE_LENGTH_0 * sizeof(QUEUE_ITEM_TYPE_0)];
#endif
#if QUEUE_1_ENABLE
static uint8_t s_queue_storage_1[QUEUE_LENGTH_1 * sizeof(QUEUE_ITEM_TYPE_1)];
#endif
#if QUEUE_2_ENABLE
static uint8_t s_queue_storage_2[QUEUE_LENGTH_2 * sizeof(QUEUE_ITEM_TYPE_2)];
#endif
#if QUEUE_3_ENABLE
static uint8_t s_queue_storage_3[QUEUE_LENGTH_3 * sizeof(QUEUE_ITEM_TYPE_3)];
#endif
#if QUEUE_4_ENABLE
static uint8_t s_queue_storage_4[QUEUE_LENGTH_4 * sizeof(QUEUE_ITEM_TYPE_4)];
#endif
#if QUEUE_5_ENABLE
static uint8_t s_queue_storage_5[QUEUE_LENGTH_5 * sizeof(QUEUE_ITEM_TYPE_5)];
#endif
#if QUEUE_6_ENABLE
static uint8_t s_queue_storage_6[QUEUE_LENGTH_6 * sizeof(QUEUE_ITEM_TYPE_6)];
#endif
#if QUEUE_7_ENABLE
static uint8_t s_queue_storage_7[QUEUE_LENGTH_7 * sizeof(QUEUE_ITEM_TYPE_7)];
#endif
#if TASK_0_ENABLE
static StackType_t s_task_stack_0[TASK_STACK_DEPTH_0];
#endif
#if TASK_1_ENABLE
static StackType_t s_task_stack_1[TASK_STACK_DEPTH_1];
#endif
#if TASK_2_ENABLE
static StackType_t s_task_stack_2[TASK_STACK_DEPTH_2];
#endif
#if TASK_3_ENABLE
static StackType_t s_task_stack_3[TASK_STACK_DEPTH_3];
#endif
#if TASK_4_ENABLE
static StackType_t s_task_stack_4[TASK_STACK_DEPTH_4];
#endif
#if TASK_5_ENABLE
static StackType_t s_task_stack_5[TASK_STACK_DEPTH_5];
#endif
#if TASK_6_ENABLE
static StackType_t s_task_stack_6[TASK_STACK_DEPTH_6];
#endif
#if TASK_7_ENABLE
static StackType_t s_task_stack_7[TASK_STACK_DEPTH_7];
#endif
#if TASK_8_ENABLE
static StackType_t s_task_stack_8[TASK_STACK_DEPTH_8];
#endif
#if TASK_9_ENABLE
static StackType_t s_task_stack_9[TASK_STACK_DEPTH_9];
#endif
#if TASK_10_ENABLE
static StackType_t s_task_stack_10[TASK_STACK_DEPTH_10];
#endif
#if TASK_11_ENABLE
static StackType_t s_task_stack_11[TASK_STACK_DEPTH_11];
#endif
#if TASK_12_ENABLE
static StackType_t s_task_stack_12[TASK_STACK_DEPTH_12];
#endif
#if TASK_13_ENABLE
static StackType_t s_task_stack_13[TASK_STACK_DEPTH_13];
#endif
#if TASK_14_ENABLE
static StackType_t s_task_stack_14[TASK_STACK_DEPTH_14];
#endif
#if TASK_15_ENABLE
static StackType_t s_task_stack_15[TASK_STACK_DEPTH_15];
#endif

#if TASK_0_ENABLE
static StaticTask_t s_task_buffer_0;
#endif
#if TASK_1_ENABLE
static StaticTask_t s_task_buffer_1;
#endif
#if TASK_2_ENABLE
static StaticTask_t s_task_buffer_2;
#endif
#if TASK_3_ENABLE
static StaticTask_t s_task_buffer_3;
#endif
#if TASK_4_ENABLE
static StaticTask_t s_task_buffer_4;
#endif
#if TASK_5_ENABLE
static StaticTask_t s_task_buffer_5;
#endif
#if TASK_6_ENABLE
static StaticTask_t s_task_buffer_6;
#endif
#if TASK_7_ENABLE
static StaticTask_t s_task_buffer_7;
#endif
#if TASK_8_ENABLE
static StaticTask_t s_task_buffer_8;
#endif
#if TASK_9_ENABLE
static StaticTask_t s_task_buffer_9;
#endif
#if TASK_10_ENABLE
static StaticTask_t s_task_buffer_10;
#endif
#if TASK_11_ENABLE
static StaticTask_t s_task_buffer_11;
#endif
#if TASK_12_ENABLE
static StaticTask_t s_task_buffer_12;
#endif
#if TASK_13_ENABLE
static StaticTask_t s_task_buffer_13;
#endif
#if TASK_14_ENABLE
static StaticTask_t s_task_buffer_14;
#endif
#if TASK_15_ENABLE
static StaticTask_t s_task_buffer_15;
#endif

#if SEMAPHORE_0_ENABLE
static StaticSemaphore_t s_semaphore_buffer_0;
#endif
#if SEMAPHORE_1_ENABLE
static StaticSemaphore_t s_semaphore_buffer_1;
#endif
#if SEMAPHORE_2_ENABLE
static StaticSemaphore_t s_semaphore_buffer_2;
#endif
#if SEMAPHORE_3_ENABLE
static StaticSemaphore_t s_semaphore_buffer_3;
#endif
#if SEMAPHORE_4_ENABLE
static StaticSemaphore_t s_semaphore_buffer_4;
#endif
#if SEMAPHORE_5_ENABLE
static StaticSemaphore_t s_semaphore_buffer_5;
#endif
#if SEMAPHORE_6_ENABLE
static StaticSemaphore_t s_semaphore_buffer_6;
#endif
#if SEMAPHORE_7_ENABLE
static StaticSemaphore_t s_semaphore_buffer_7;
#endif

