LuckiBit/stm32-template/stm32f429ig/application/app/tasks/tasks.c
#if MUTEX_0_ENABLE
static StaticSemaphore_t s_mutex_buffer_0;
#endif
#if MUTEX_1_ENABLE
static StaticSemaphore_t s_mutex_buffer_1;
#endif
#if MUTEX_2_ENABLE
static StaticSemaphore_t s_mutex_buffer_2;
#endif
#if MUTEX_3_ENABLE
static StaticSemaphore_t s_mutex_buffer_3;
#endif
#if MUTEX_4_ENABLE
static StaticSemaphore_t s_mutex_buffer_4;
#endif
#if MUTEX_5_ENABLE
static StaticSemaphore_t s_mutex_buffer_5;
#endif
#if MUTEX_6_ENABLE
static StaticSemaphore_t s_mutex_buffer_6;
#endif
#if MUTEX_7_ENABLE
static StaticSemaphore_t s_mutex_buffer_7;
#endif

#if QUEUE_0_ENABLE
static StaticQueue_t s_queue_buffer_0;
#endif
#if QUEUE_1_ENABLE
static StaticQueue_t s_queue_buffer_1;
#endif
#if QUEUE_2_ENABLE
static StaticQueue_t s_queue_buffer_2;
#endif
#if QUEUE_3_ENABLE
static StaticQueue_t s_queue_buffer_3;
#endif
#if QUEUE_4_ENABLE
static StaticQueue_t s_queue_buffer_4;
#endif
#if QUEUE_5_ENABLE
static StaticQueue_t s_queue_buffer_5;
#endif
#if QUEUE_6_ENABLE
static StaticQueue_t s_queue_buffer_6;
#endif
#if QUEUE_7_ENABLE
static StaticQueue_t s_queue_buffer_7;
#endif

#if EVENT_GROUP_0_ENABLE
static StaticEventGroup_t s_event_group_buffer_0;
#endif
#if EVENT_GROUP_1_ENABLE
static StaticEventGroup_t s_event_group_buffer_1;
#endif
#if EVENT_GROUP_2_ENABLE
static StaticEventGroup_t s_event_group_buffer_2;
#endif
#if EVENT_GROUP_3_ENABLE
static StaticEventGroup_t s_event_group_buffer_3;
#endif

#if TIMER_0_ENABLE
static StaticTimer_t s_timer_buffer_0;
#endif
#if TIMER_1_ENABLE
static StaticTimer_t s_timer_buffer_1;
#endif
#if TIMER_2_ENABLE
static StaticTimer_t s_timer_buffer_2;
#endif
#if TIMER_3_ENABLE
static StaticTimer_t s_timer_buffer_3;
#endif

#if TASK_0_ENABLE
static TaskHandle_t s_task_handle_0 = NULL;
#endif
#if TASK_1_ENABLE
static TaskHandle_t s_task_handle_1 = NULL;
#endif
#if TASK_2_ENABLE
static TaskHandle_t s_task_handle_2 = NULL;
#endif
#if TASK_3_ENABLE
static TaskHandle_t s_task_handle_3 = NULL;
#endif
#if TASK_4_ENABLE
static TaskHandle_t s_task_handle_4 = NULL;
#endif
#if TASK_5_ENABLE
static TaskHandle_t s_task_handle_5 = NULL;
#endif
#if TASK_6_ENABLE
static TaskHandle_t s_task_handle_6 = NULL;
#endif
#if TASK_7_ENABLE
static TaskHandle_t s_task_handle_7 = NULL;
#endif
#if TASK_8_ENABLE
static TaskHandle_t s_task_handle_8 = NULL;
#endif
#if TASK_9_ENABLE
static TaskHandle_t s_task_handle_9 = NULL;
#endif
#if TASK_10_ENABLE
static TaskHandle_t s_task_handle_10 = NULL;
#endif
#if TASK_11_ENABLE
static TaskHandle_t s_task_handle_11 = NULL;
#endif
#if TASK_12_ENABLE
static TaskHandle_t s_task_handle_12 = NULL;
#endif
#if TASK_13_ENABLE
static TaskHandle_t s_task_handle_13 = NULL;
#endif
#if TASK_14_ENABLE
static TaskHandle_t s_task_handle_14 = NULL;
#endif
#if TASK_15_ENABLE
static TaskHandle_t s_task_handle_15 = NULL;
#endif

#if SEMAPHORE_0_ENABLE
static SemaphoreHandle_t s_semaphore_handle_0 = NULL;
#endif
#if SEMAPHORE_1_ENABLE
static SemaphoreHandle_t s_semaphore_handle_1 = NULL;
#endif
#if SEMAPHORE_2_ENABLE
static SemaphoreHandle_t s_semaphore_handle_2 = NULL;
#endif
#if SEMAPHORE_3_ENABLE
static SemaphoreHandle_t s_semaphore_handle_3 = NULL;
#endif
#if SEMAPHORE_4_ENABLE
static SemaphoreHandle_t s_semaphore_handle_4 = NULL;
#endif
#if SEMAPHORE_5_ENABLE
static SemaphoreHandle_t s_semaphore_handle_5 = NULL;
#endif
#if SEMAPHORE_6_ENABLE
static SemaphoreHandle_t s_semaphore_handle_6 = NULL;
#endif
#if SEMAPHORE_7_ENABLE
static SemaphoreHandle_t s_semaphore_handle_7 = NULL;
#endif

#if MUTEX_0_ENABLE
static SemaphoreHandle_t s_mutex_handle_0 = NULL;
#endif
#if MUTEX_1_ENABLE
static SemaphoreHandle_t s_mutex_handle_1 = NULL;
#endif
#if MUTEX_2_ENABLE
static SemaphoreHandle_t s_mutex_handle_2 = NULL;
#endif
#if MUTEX_3_ENABLE
static SemaphoreHandle_t s_mutex_handle_3 = NULL;
#endif
#if MUTEX_4_ENABLE
static SemaphoreHandle_t s_mutex_handle_4 = NULL;
#endif
#if MUTEX_5_ENABLE
static SemaphoreHandle_t s_mutex_handle_5 = NULL;
#endif
#if MUTEX_6_ENABLE
static SemaphoreHandle_t s_mutex_handle_6 = NULL;
#endif
#if MUTEX_7_ENABLE
static SemaphoreHandle_t s_mutex_handle_7 = NULL;
#endif

#if QUEUE_0_ENABLE
static QueueHandle_t s_queue_handle_0 = NULL;
#endif
#if QUEUE_1_ENABLE
static QueueHandle_t s_queue_handle_1 = NULL;
#endif
#if QUEUE_2_ENABLE
static QueueHandle_t s_queue_handle_2 = NULL;
#endif
#if QUEUE_3_ENABLE
static QueueHandle_t s_queue_handle_3 = NULL;
#endif
#if QUEUE_4_ENABLE
static QueueHandle_t s_queue_handle_4 = NULL;
#endif
#if QUEUE_5_ENABLE
static QueueHandle_t s_queue_handle_5 = NULL;
#endif
#if QUEUE_6_ENABLE
static QueueHandle_t s_queue_handle_6 = NULL;
#endif
#if QUEUE_7_ENABLE
static QueueHandle_t s_queue_handle_7 = NULL;
#endif

#if EVENT_GROUP_0_ENABLE
static EventGroupHandle_t s_event_group_handle_0 = NULL;
#endif
#if EVENT_GROUP_1_ENABLE
static EventGroupHandle_t s_event_group_handle_1 = NULL;
#endif
#if EVENT_GROUP_2_ENABLE
static EventGroupHandle_t s_event_group_handle_2 = NULL;
#endif
#if EVENT_GROUP_3_ENABLE
static EventGroupHandle_t s_event_group_handle_3 = NULL;
#endif

#if TIMER_0_ENABLE
static TimerHandle_t s_timer_handle_0 = NULL;
#endif
#if TIMER_1_ENABLE
static TimerHandle_t s_timer_handle_1 = NULL;
#endif
#if TIMER_2_ENABLE
static TimerHandle_t s_timer_handle_2 = NULL;
#endif
#if TIMER_3_ENABLE
static TimerHandle_t s_timer_handle_3 = NULL;
#endif

#if TASK_0_ENABLE
static void task_0(void *argument);
#endif
#if TASK_1_ENABLE
static void task_1(void *argument);
#endif
#if TASK_2_ENABLE
static void task_2(void *argument);
#endif
#if TASK_3_ENABLE
static void task_3(void *argument);
#endif
#if TASK_4_ENABLE
static void task_4(void *argument);
#endif
#if TASK_5_ENABLE
static void task_5(void *argument);
#endif
#if TASK_6_ENABLE
static void task_6(void *argument);
#endif
#if TASK_7_ENABLE
static void task_7(void *argument);
#endif
#if TASK_8_ENABLE
static void task_8(void *argument);
#endif
#if TASK_9_ENABLE
static void task_9(void *argument);
#endif
#if TASK_10_ENABLE
static void task_10(void *argument);
#endif
#if TASK_11_ENABLE
static void task_11(void *argument);
#endif
#if TASK_12_ENABLE
static void task_12(void *argument);
#endif
#if TASK_13_ENABLE
static void task_13(void *argument);
#endif
#if TASK_14_ENABLE
static void task_14(void *argument);
#endif
#if TASK_15_ENABLE
static void task_15(void *argument);
#endif
#if TIMER_0_ENABLE
static void timer_callback_0(TimerHandle_t timer);
#endif
#if TIMER_1_ENABLE
static void timer_callback_1(TimerHandle_t timer);
#endif
#if TIMER_2_ENABLE
static void timer_callback_2(TimerHandle_t timer);
#endif
#if TIMER_3_ENABLE
static void timer_callback_3(TimerHandle_t timer);
#endif

static BaseType_t create_objects(void);
static BaseType_t create_tasks(void);
static BaseType_t start_timers(void);

bool tasks_create(void)
{
    bool       create_failed    = false;
    bool       create_succeeded = false;
    BaseType_t create_result    = create_objects();

    create_failed = create_result != pdPASS;
    if(create_failed)
    {
        return false;
    }
    create_result    = create_tasks();
    create_succeeded = create_result == pdPASS;
    return create_succeeded;
}

bool tasks_start(void)
{
    bool       start_succeeded = false;
    BaseType_t start_result    = start_timers();

    start_succeeded = start_result == pdPASS;
    return start_succeeded;
}

static BaseType_t create_objects(void)
{
#if SEMAPHORE_0_ENABLE
    {
        bool object_missing = false;

        s_semaphore_handle_0 = xSemaphoreCreateBinaryStatic(&s_semaphore_buffer_0);
        object_missing       = s_semaphore_handle_0 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if SEMAPHORE_1_ENABLE
    {
        bool object_missing = false;

        s_semaphore_handle_1 = xSemaphoreCreateBinaryStatic(&s_semaphore_buffer_1);
        object_missing       = s_semaphore_handle_1 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if SEMAPHORE_2_ENABLE
    {
        bool object_missing = false;

        s_semaphore_handle_2 = xSemaphoreCreateBinaryStatic(&s_semaphore_buffer_2);
        object_missing       = s_semaphore_handle_2 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if SEMAPHORE_3_ENABLE
    {
        bool object_missing = false;

        s_semaphore_handle_3 = xSemaphoreCreateBinaryStatic(&s_semaphore_buffer_3);
        object_missing       = s_semaphore_handle_3 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if SEMAPHORE_4_ENABLE
    {
        bool object_missing = false;

        s_semaphore_handle_4 = xSemaphoreCreateBinaryStatic(&s_semaphore_buffer_4);
        object_missing       = s_semaphore_handle_4 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if SEMAPHORE_5_ENABLE
    {
        bool object_missing = false;

        s_semaphore_handle_5 = xSemaphoreCreateBinaryStatic(&s_semaphore_buffer_5);
        object_missing       = s_semaphore_handle_5 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if SEMAPHORE_6_ENABLE
    {
        bool object_missing = false;

        s_semaphore_handle_6 = xSemaphoreCreateBinaryStatic(&s_semaphore_buffer_6);
        object_missing       = s_semaphore_handle_6 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if SEMAPHORE_7_ENABLE
    {
        bool object_missing = false;

        s_semaphore_handle_7 = xSemaphoreCreateBinaryStatic(&s_semaphore_buffer_7);
        object_missing       = s_semaphore_handle_7 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if MUTEX_0_ENABLE
    {
        bool object_missing = false;

        s_mutex_handle_0 = xSemaphoreCreateMutexStatic(&s_mutex_buffer_0);
        object_missing   = s_mutex_handle_0 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if MUTEX_1_ENABLE
    {
        bool object_missing = false;

        s_mutex_handle_1 = xSemaphoreCreateMutexStatic(&s_mutex_buffer_1);
        object_missing   = s_mutex_handle_1 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if MUTEX_2_ENABLE
    {
        bool object_missing = false;

        s_mutex_handle_2 = xSemaphoreCreateMutexStatic(&s_mutex_buffer_2);
        object_missing   = s_mutex_handle_2 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if MUTEX_3_ENABLE
    {
        bool object_missing = false;

        s_mutex_handle_3 = xSemaphoreCreateMutexStatic(&s_mutex_buffer_3);
        object_missing   = s_mutex_handle_3 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if MUTEX_4_ENABLE
    {
        bool object_missing = false;

        s_mutex_handle_4 = xSemaphoreCreateMutexStatic(&s_mutex_buffer_4);
        object_missing   = s_mutex_handle_4 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if MUTEX_5_ENABLE
    {
        bool object_missing = false;

        s_mutex_handle_5 = xSemaphoreCreateMutexStatic(&s_mutex_buffer_5);
        object_missing   = s_mutex_handle_5 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if MUTEX_6_ENABLE
    {
        bool object_missing = false;

