LuckiBit/stm32-template/stm32f429ig/application/app/tasks/tasks.c
        s_mutex_handle_6 = xSemaphoreCreateMutexStatic(&s_mutex_buffer_6);
        object_missing   = s_mutex_handle_6 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if MUTEX_7_ENABLE
    {
        bool object_missing = false;

        s_mutex_handle_7 = xSemaphoreCreateMutexStatic(&s_mutex_buffer_7);
        object_missing   = s_mutex_handle_7 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if QUEUE_0_ENABLE
    {
        bool object_missing = false;

        s_queue_handle_0 = xQueueCreateStatic(QUEUE_LENGTH_0,
                                              sizeof(QUEUE_ITEM_TYPE_0),
                                              s_queue_storage_0,
                                              &s_queue_buffer_0);
        object_missing   = s_queue_handle_0 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if QUEUE_1_ENABLE
    {
        bool object_missing = false;

        s_queue_handle_1 = xQueueCreateStatic(QUEUE_LENGTH_1,
                                              sizeof(QUEUE_ITEM_TYPE_1),
                                              s_queue_storage_1,
                                              &s_queue_buffer_1);
        object_missing   = s_queue_handle_1 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if QUEUE_2_ENABLE
    {
        bool object_missing = false;

        s_queue_handle_2 = xQueueCreateStatic(QUEUE_LENGTH_2,
                                              sizeof(QUEUE_ITEM_TYPE_2),
                                              s_queue_storage_2,
                                              &s_queue_buffer_2);
        object_missing   = s_queue_handle_2 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if QUEUE_3_ENABLE
    {
        bool object_missing = false;

        s_queue_handle_3 = xQueueCreateStatic(QUEUE_LENGTH_3,
                                              sizeof(QUEUE_ITEM_TYPE_3),
                                              s_queue_storage_3,
                                              &s_queue_buffer_3);
        object_missing   = s_queue_handle_3 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if QUEUE_4_ENABLE
    {
        bool object_missing = false;

        s_queue_handle_4 = xQueueCreateStatic(QUEUE_LENGTH_4,
                                              sizeof(QUEUE_ITEM_TYPE_4),
                                              s_queue_storage_4,
                                              &s_queue_buffer_4);
        object_missing   = s_queue_handle_4 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if QUEUE_5_ENABLE
    {
        bool object_missing = false;

        s_queue_handle_5 = xQueueCreateStatic(QUEUE_LENGTH_5,
                                              sizeof(QUEUE_ITEM_TYPE_5),
                                              s_queue_storage_5,
                                              &s_queue_buffer_5);
        object_missing   = s_queue_handle_5 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if QUEUE_6_ENABLE
    {
        bool object_missing = false;

        s_queue_handle_6 = xQueueCreateStatic(QUEUE_LENGTH_6,
                                              sizeof(QUEUE_ITEM_TYPE_6),
                                              s_queue_storage_6,
                                              &s_queue_buffer_6);
        object_missing   = s_queue_handle_6 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if QUEUE_7_ENABLE
    {
        bool object_missing = false;

        s_queue_handle_7 = xQueueCreateStatic(QUEUE_LENGTH_7,
                                              sizeof(QUEUE_ITEM_TYPE_7),
                                              s_queue_storage_7,
                                              &s_queue_buffer_7);
        object_missing   = s_queue_handle_7 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if EVENT_GROUP_0_ENABLE
    {
        bool object_missing = false;

        s_event_group_handle_0 = xEventGroupCreateStatic(&s_event_group_buffer_0);
        object_missing         = s_event_group_handle_0 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if EVENT_GROUP_1_ENABLE
    {
        bool object_missing = false;

        s_event_group_handle_1 = xEventGroupCreateStatic(&s_event_group_buffer_1);
        object_missing         = s_event_group_handle_1 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if EVENT_GROUP_2_ENABLE
    {
        bool object_missing = false;

        s_event_group_handle_2 = xEventGroupCreateStatic(&s_event_group_buffer_2);
        object_missing         = s_event_group_handle_2 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if EVENT_GROUP_3_ENABLE
    {
        bool object_missing = false;

        s_event_group_handle_3 = xEventGroupCreateStatic(&s_event_group_buffer_3);
        object_missing         = s_event_group_handle_3 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if TIMER_0_ENABLE
    {
        bool object_missing = false;

        s_timer_handle_0 = xTimerCreateStatic(TIMER_NAME_0,
                                              pdMS_TO_TICKS(TIMER_PERIOD_MS_0),
                                              pdTRUE,
                                              NULL,
                                              timer_callback_0,
                                              &s_timer_buffer_0);
        object_missing   = s_timer_handle_0 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if TIMER_1_ENABLE
    {
        bool object_missing = false;

        s_timer_handle_1 = xTimerCreateStatic(TIMER_NAME_1,
                                              pdMS_TO_TICKS(TIMER_PERIOD_MS_1),
                                              pdTRUE,
                                              NULL,
                                              timer_callback_1,
                                              &s_timer_buffer_1);
        object_missing   = s_timer_handle_1 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if TIMER_2_ENABLE
    {
        bool object_missing = false;

