LuckiBit/stm32-template/stm32f429ig/application/app/tasks/tasks.c
        s_timer_handle_2 = xTimerCreateStatic(TIMER_NAME_2,
                                              pdMS_TO_TICKS(TIMER_PERIOD_MS_2),
                                              pdTRUE,
                                              NULL,
                                              timer_callback_2,
                                              &s_timer_buffer_2);
        object_missing   = s_timer_handle_2 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
#if TIMER_3_ENABLE
    {
        bool object_missing = false;

        s_timer_handle_3 = xTimerCreateStatic(TIMER_NAME_3,
                                              pdMS_TO_TICKS(TIMER_PERIOD_MS_3),
                                              pdTRUE,
                                              NULL,
                                              timer_callback_3,
                                              &s_timer_buffer_3);
        object_missing   = s_timer_handle_3 == NULL;
        if(object_missing)
        {
            return pdFAIL;
        }
    }
#endif
    return pdPASS;
}

static BaseType_t create_tasks(void)
{
#if TASK_ENABLED_COUNT > 0
    bool task_missing = false;
#endif

#if TASK_0_ENABLE
    s_task_handle_0 = xTaskCreateStatic(task_0,
                                        TASK_NAME_0,
                                        TASK_STACK_DEPTH_0,
                                        NULL,
                                        TASK_PRIORITY_0,
                                        s_task_stack_0,
                                        &s_task_buffer_0);
    task_missing    = s_task_handle_0 == NULL;
    if(task_missing)
    {
        return pdFAIL;
    }
#endif

#if TASK_1_ENABLE
    s_task_handle_1 = xTaskCreateStatic(task_1,
                                        TASK_NAME_1,
                                        TASK_STACK_DEPTH_1,
                                        NULL,
                                        TASK_PRIORITY_1,
                                        s_task_stack_1,
                                        &s_task_buffer_1);
    task_missing    = s_task_handle_1 == NULL;
    if(task_missing)
    {
        return pdFAIL;
    }
#endif

#if TASK_2_ENABLE
    s_task_handle_2 = xTaskCreateStatic(task_2,
                                        TASK_NAME_2,
                                        TASK_STACK_DEPTH_2,
                                        NULL,
                                        TASK_PRIORITY_2,
                                        s_task_stack_2,
                                        &s_task_buffer_2);
    task_missing    = s_task_handle_2 == NULL;
    if(task_missing)
    {
        return pdFAIL;
    }
#endif

#if TASK_3_ENABLE
    s_task_handle_3 = xTaskCreateStatic(task_3,
                                        TASK_NAME_3,
                                        TASK_STACK_DEPTH_3,
                                        NULL,
                                        TASK_PRIORITY_3,
                                        s_task_stack_3,
                                        &s_task_buffer_3);
    task_missing    = s_task_handle_3 == NULL;
    if(task_missing)
    {
        return pdFAIL;
    }
#endif

#if TASK_4_ENABLE
    s_task_handle_4 = xTaskCreateStatic(task_4,
                                        TASK_NAME_4,
                                        TASK_STACK_DEPTH_4,
                                        NULL,
                                        TASK_PRIORITY_4,
                                        s_task_stack_4,
                                        &s_task_buffer_4);
    task_missing    = s_task_handle_4 == NULL;
    if(task_missing)
    {
        return pdFAIL;
    }
#endif

#if TASK_5_ENABLE
    s_task_handle_5 = xTaskCreateStatic(task_5,
                                        TASK_NAME_5,
                                        TASK_STACK_DEPTH_5,
                                        NULL,
                                        TASK_PRIORITY_5,
                                        s_task_stack_5,
                                        &s_task_buffer_5);
    task_missing    = s_task_handle_5 == NULL;
    if(task_missing)
    {
        return pdFAIL;
    }
#endif

#if TASK_6_ENABLE
    s_task_handle_6 = xTaskCreateStatic(task_6,
                                        TASK_NAME_6,
                                        TASK_STACK_DEPTH_6,
                                        NULL,
                                        TASK_PRIORITY_6,
                                        s_task_stack_6,
                                        &s_task_buffer_6);
    task_missing    = s_task_handle_6 == NULL;
    if(task_missing)
    {
        return pdFAIL;
    }
#endif

#if TASK_7_ENABLE
    s_task_handle_7 = xTaskCreateStatic(task_7,
                                        TASK_NAME_7,
                                        TASK_STACK_DEPTH_7,
                                        NULL,
                                        TASK_PRIORITY_7,
                                        s_task_stack_7,
                                        &s_task_buffer_7);
    task_missing    = s_task_handle_7 == NULL;
    if(task_missing)
    {
        return pdFAIL;
    }
#endif

#if TASK_8_ENABLE
    s_task_handle_8 = xTaskCreateStatic(task_8,
                                        TASK_NAME_8,
                                        TASK_STACK_DEPTH_8,
                                        NULL,
                                        TASK_PRIORITY_8,
                                        s_task_stack_8,
                                        &s_task_buffer_8);
    task_missing    = s_task_handle_8 == NULL;
    if(task_missing)
    {
        return pdFAIL;
    }
#endif

#if TASK_9_ENABLE
    s_task_handle_9 = xTaskCreateStatic(task_9,
                                        TASK_NAME_9,
                                        TASK_STACK_DEPTH_9,
                                        NULL,
                                        TASK_PRIORITY_9,
                                        s_task_stack_9,
                                        &s_task_buffer_9);
    task_missing    = s_task_handle_9 == NULL;
    if(task_missing)
    {
        return pdFAIL;
    }
#endif

#if TASK_10_ENABLE
    s_task_handle_10 = xTaskCreateStatic(task_10,
                                         TASK_NAME_10,
                                         TASK_STACK_DEPTH_10,
                                         NULL,
                                         TASK_PRIORITY_10,
                                         s_task_stack_10,
                                         &s_task_buffer_10);
    task_missing     = s_task_handle_10 == NULL;
    if(task_missing)
    {
        return pdFAIL;
    }
#endif

