LuckiBit/stm32-template/stm32f429ig/application/app/tasks/tasks.c
#if TASK_11_ENABLE
    s_task_handle_11 = xTaskCreateStatic(task_11,
                                         TASK_NAME_11,
                                         TASK_STACK_DEPTH_11,
                                         NULL,
                                         TASK_PRIORITY_11,
                                         s_task_stack_11,
                                         &s_task_buffer_11);
    task_missing     = s_task_handle_11 == NULL;
    if(task_missing)
    {
        return pdFAIL;
    }
#endif

#if TASK_12_ENABLE
    s_task_handle_12 = xTaskCreateStatic(task_12,
                                         TASK_NAME_12,
                                         TASK_STACK_DEPTH_12,
                                         NULL,
                                         TASK_PRIORITY_12,
                                         s_task_stack_12,
                                         &s_task_buffer_12);
    task_missing     = s_task_handle_12 == NULL;
    if(task_missing)
    {
        return pdFAIL;
    }
#endif

#if TASK_13_ENABLE
    s_task_handle_13 = xTaskCreateStatic(task_13,
                                         TASK_NAME_13,
                                         TASK_STACK_DEPTH_13,
                                         NULL,
                                         TASK_PRIORITY_13,
                                         s_task_stack_13,
                                         &s_task_buffer_13);
    task_missing     = s_task_handle_13 == NULL;
    if(task_missing)
    {
        return pdFAIL;
    }
#endif

#if TASK_14_ENABLE
    s_task_handle_14 = xTaskCreateStatic(task_14,
                                         TASK_NAME_14,
                                         TASK_STACK_DEPTH_14,
                                         NULL,
                                         TASK_PRIORITY_14,
                                         s_task_stack_14,
                                         &s_task_buffer_14);
    task_missing     = s_task_handle_14 == NULL;
    if(task_missing)
    {
        return pdFAIL;
    }
#endif

#if TASK_15_ENABLE
    s_task_handle_15 = xTaskCreateStatic(task_15,
                                         TASK_NAME_15,
                                         TASK_STACK_DEPTH_15,
                                         NULL,
                                         TASK_PRIORITY_15,
                                         s_task_stack_15,
                                         &s_task_buffer_15);
    task_missing     = s_task_handle_15 == NULL;
    if(task_missing)
    {
        return pdFAIL;
    }
#endif

    return pdPASS;
}

static BaseType_t start_timers(void)
{
#if TASK_SOFTWARE_TIMERS_ENABLED
    bool       start_failed = false;
    BaseType_t start_result = pdFAIL;
#endif
#if TIMER_0_ENABLE
    start_result = xTimerStart(s_timer_handle_0, 0U);
    start_failed = start_result != pdPASS;
    if(start_failed)
    {
        return pdFAIL;
    }
#endif
#if TIMER_1_ENABLE
    start_result = xTimerStart(s_timer_handle_1, 0U);
    start_failed = start_result != pdPASS;
    if(start_failed)
    {
        return pdFAIL;
    }
#endif
#if TIMER_2_ENABLE
    start_result = xTimerStart(s_timer_handle_2, 0U);
    start_failed = start_result != pdPASS;
    if(start_failed)
    {
        return pdFAIL;
    }
#endif
#if TIMER_3_ENABLE
    start_result = xTimerStart(s_timer_handle_3, 0U);
    start_failed = start_result != pdPASS;
    if(start_failed)
    {
        return pdFAIL;
    }
#endif
    return pdPASS;
}

#if TASK_0_ENABLE
static void task_0(void *argument)
{
    (void)argument;

    /** Complete local initialization before reporting this slot ready. */
    system_manager_report_ready(TASK_0_READY_BIT);
    system_manager_wait_running();

    for(;;)
    {
        (void)xEventGroupWaitBits(s_event_group_handle_0,
                                  EVENT_TIMER_BIT_0,
                                  pdTRUE,
                                  pdTRUE,
                                  portMAX_DELAY);
    }
}
#endif

#if TASK_1_ENABLE
static void task_1(void *argument)
{
    (void)argument;

    /** Complete local initialization before reporting this slot ready. */
    system_manager_report_ready(TASK_1_READY_BIT);
    system_manager_wait_running();

    for(;;)
    {
        (void)xEventGroupWaitBits(s_event_group_handle_1,
                                  EVENT_TIMER_BIT_1,
                                  pdTRUE,
                                  pdTRUE,
                                  portMAX_DELAY);
    }
}
#endif

#if TASK_2_ENABLE
static void task_2(void *argument)
{
    (void)argument;

    /** Complete local initialization before reporting this slot ready. */
    system_manager_report_ready(TASK_2_READY_BIT);
    system_manager_wait_running();

    /** Reserved business slot: block without polling until future work is assigned.
     * Notifications carry no payload here; define a protocol when implementing this task.
     */
    for(;;)
    {
        (void)ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    }
}
#endif

#if TASK_3_ENABLE
static void task_3(void *argument)
{
    (void)argument;

    /** Complete local initialization before reporting this slot ready. */
    system_manager_report_ready(TASK_3_READY_BIT);
    system_manager_wait_running();

    /** Reserved business slot: block without polling until future work is assigned.
     * Notifications carry no payload here; define a protocol when implementing this task.
     */
    for(;;)
    {
        (void)ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    }
}
#endif

#if TASK_4_ENABLE
static void task_4(void *argument)
{
    (void)argument;

    /** Complete local initialization before reporting this slot ready. */
    system_manager_report_ready(TASK_4_READY_BIT);
    system_manager_wait_running();

    led_run();
}
#endif

#if TASK_5_ENABLE
static void task_5(void *argument)
{
    (void)argument;

    /** Complete local initialization before reporting this slot ready. */
    system_manager_report_ready(TASK_5_READY_BIT);
    system_manager_wait_running();

