LuckiBit/stm32-template/stm32f429ig/application/app/tasks/tasks.c
    /** Reserved business slot: block without polling until future work is assigned.
     * Notifications carry no payload here; define a protocol when implementing this task.
     */
    for(;;)
    {
        (void)ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    }
}
#endif

#if TASK_6_ENABLE
static void task_6(void *argument)
{
    (void)argument;

    /** Complete local initialization before reporting this slot ready. */
    system_manager_report_ready(TASK_6_READY_BIT);
    system_manager_wait_running();

    /** Reserved business slot: block without polling until future work is assigned.
     * Notifications carry no payload here; define a protocol when implementing this task.
     */
    for(;;)
    {
        (void)ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    }
}
#endif

#if TASK_7_ENABLE
static void task_7(void *argument)
{
    (void)argument;

    /** Complete local initialization before reporting this slot ready. */
    system_manager_report_ready(TASK_7_READY_BIT);
    system_manager_wait_running();

    /** Reserved business slot: block without polling until future work is assigned.
     * Notifications carry no payload here; define a protocol when implementing this task.
     */
    for(;;)
    {
        (void)ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    }
}
#endif

#if TASK_8_ENABLE
static void task_8(void *argument)
{
    (void)argument;

    /** Complete local initialization before reporting this slot ready. */
    system_manager_report_ready(TASK_8_READY_BIT);
    system_manager_wait_running();

    /** Reserved business slot: block without polling until future work is assigned.
     * Notifications carry no payload here; define a protocol when implementing this task.
     */
    for(;;)
    {
        (void)ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    }
}
#endif

#if TASK_9_ENABLE
static void task_9(void *argument)
{
    (void)argument;

    /** Complete local initialization before reporting this slot ready. */
    system_manager_report_ready(TASK_9_READY_BIT);
    system_manager_wait_running();

    /** Reserved business slot: block without polling until future work is assigned.
     * Notifications carry no payload here; define a protocol when implementing this task.
     */
    for(;;)
    {
        (void)ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    }
}
#endif

#if TASK_10_ENABLE
static void task_10(void *argument)
{
    (void)argument;

    /** Complete local initialization before reporting this slot ready. */
    system_manager_report_ready(TASK_10_READY_BIT);
    system_manager_wait_running();

    /** Reserved business slot: block without polling until future work is assigned.
     * Notifications carry no payload here; define a protocol when implementing this task.
     */
    for(;;)
    {
        (void)ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    }
}
#endif

#if TASK_11_ENABLE
static void task_11(void *argument)
{
    (void)argument;

    /** Complete local initialization before reporting this slot ready. */
    system_manager_report_ready(TASK_11_READY_BIT);
    system_manager_wait_running();

    /** Reserved business slot: block without polling until future work is assigned.
     * Notifications carry no payload here; define a protocol when implementing this task.
     */
    for(;;)
    {
        (void)ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    }
}
#endif

#if TASK_12_ENABLE
static void task_12(void *argument)
{
    (void)argument;

    /** Complete local initialization before reporting this slot ready. */
    system_manager_report_ready(TASK_12_READY_BIT);
    system_manager_wait_running();

    /** Reserved business slot: block without polling until future work is assigned.
     * Notifications carry no payload here; define a protocol when implementing this task.
     */
    for(;;)
    {
        (void)ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    }
}
#endif

#if TASK_13_ENABLE
static void task_13(void *argument)
{
    (void)argument;

    /** Complete local initialization before reporting this slot ready. */
    system_manager_report_ready(TASK_13_READY_BIT);
    system_manager_wait_running();

    /** Reserved business slot: block without polling until future work is assigned.
     * Notifications carry no payload here; define a protocol when implementing this task.
     */
    for(;;)
    {
        (void)ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    }
}
#endif

#if TASK_14_ENABLE
static void task_14(void *argument)
{
    (void)argument;

    /** Complete local initialization before reporting this slot ready. */
    system_manager_report_ready(TASK_14_READY_BIT);
    system_manager_wait_running();

    /** Reserved business slot: block without polling until future work is assigned.
     * Notifications carry no payload here; define a protocol when implementing this task.
     */
    for(;;)
    {
        (void)ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    }
}
#endif

#if TASK_15_ENABLE
static void task_15(void *argument)
{
    (void)argument;

    /** Complete local initialization before reporting this slot ready. */
    system_manager_report_ready(TASK_15_READY_BIT);
    system_manager_wait_running();

    /** Reserved business slot: block without polling until future work is assigned.
     * Notifications carry no payload here; define a protocol when implementing this task.
     */
    for(;;)
    {
        (void)ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    }
}
#endif

#if TIMER_0_ENABLE
static void timer_callback_0(TimerHandle_t timer)
{
    (void)timer;
    (void)xEventGroupSetBits(s_event_group_handle_0, EVENT_TIMER_BIT_0);
}
#endif

#if TIMER_1_ENABLE
static void timer_callback_1(TimerHandle_t timer)
{
    (void)timer;
    (void)xEventGroupSetBits(s_event_group_handle_1, EVENT_TIMER_BIT_1);
}
#endif

#if TIMER_2_ENABLE
static void timer_callback_2(TimerHandle_t timer)
{
    (void)timer;
    /** Reserved callback. Any future timer work must remain non-blocking. */
}
#endif

#if TIMER_3_ENABLE
static void timer_callback_3(TimerHandle_t timer)
{
    (void)timer;
    /** Reserved callback. Any future timer work must remain non-blocking. */
}
#endif
